# Taps

tap "hmarr/tap"
tap "pulumi/tap"
tap "railwaycat/emacsmacport"
tap "sst/tap"
tap "withgraphite/tap"

# Brews

brew "ast-grep"
brew "atuin"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bacon"
brew "bat"
brew "bob"
brew "cargo-instruments"
brew "cfitsio"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "delta"
brew "duckdb"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-revise"
brew "git"
brew "gnu-sed"
brew "go"
brew "gopls"
brew "gpg"
brew "graphviz"
brew "grep"
brew "helix"
brew "hmarr/tap/codeowners"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "iperf3"
brew "ispell"
brew "jless"
brew "jujutsu"
brew "lima"
brew "llm"
brew "make"
brew "mas"
brew "mergiraf"
brew "mise"
brew "mkcert"
brew "node"
brew "pandoc"
brew "pkg-config"
brew "prr"
brew "pstree"
brew "pulumi/tap/pulumi"
brew "python"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "ruff-lsp"  # also installs ruff
brew "sqlite3"
brew "sst/tap/opencode"
brew "stow"
brew "television"
brew "tmux"
brew "tokei"
brew "tree-sitter-cli"
brew "universal-ctags"
brew "uv"
brew "viddy"
brew "wakeonlan"
brew "watchexec"
brew "websocat"
brew "withgraphite/tap/graphite"
brew "xh"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh"

# for localStack

brew "aws-sam-cli"
brew "bitwarden-cli"
brew "libvirt"
brew "snappy"

# Casks

## music

cask "ableton-live-lite" if `hostname`.strip == "mm"
cask "focusrite-control-2"

## other

cask "1password-cli"
cask "1password"
cask "betterdisplay"
cask "blender"
cask "brave-browser"
cask "claude-code"
cask "codex"
cask "cursor"
cask "deskpad"
cask "docker-desktop"
cask "firefox"
cask "font-atkinson-hyperlegible-mono"
cask "font-commit-mono"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "godot"
cask "google-chrome"
cask "iina"
cask "inkscape"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "keymapp"
cask "meld"
cask "mitmproxy"
cask "obs"
cask "obsidian"
cask "opencode-desktop"
cask "railwaycat/emacsmacport/emacs-mac"
cask "raycast"
cask "shotcut"
cask "slack"
cask "steam"
cask "tailscale-app"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet" if `hostname`.strip == "mm"
cask "whatsapp"
cask "yaak"
cask "yubico-yubikey-manager" if `hostname`.strip == "mm"
cask "zed"
cask "zen"
cask "zoom"

# for LocalStack
cask "clockify"
cask "notion"

# Mac App Store apps
mas "1Password for Safari", id: 1569813296
mas "DaisyDisk", id: 411643860
mas "Wipr 2", id: 1662217862
