# Taps

tap "hmarr/tap"
tap "pulumi/tap"
tap "railwaycat/emacsmacport"
tap "sst/tap"
tap "withgraphite/tap"

# Brews

brew "autoconf"
brew "automake"
brew "awscli"
brew "bacon"
brew "bat"
brew "cargo-instruments"
brew "cfitsio"
brew "cocoapods"
brew "colima"
brew "coreutils"
brew "curl"
brew "delta"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-revise"
brew "git"
brew "gnu-sed"
brew "go"
brew "gpg"
brew "graphviz"
brew "helix"
brew "hmarr/tap/codeowners"
brew "htop"
brew "hyperfine"
brew "ispell"
brew "jless"
brew "jujutsu"
brew "lima"
brew "llm"
brew "make"
brew "mas"
brew "mergiraf"
brew "mise"
brew "neovim"
brew "node"
brew "pkg-config"
brew "prr"
brew "pulumi/tap/pulumi"
brew "python"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "sapling"
brew "sqlite3"
brew "sst/tap/opencode"
brew "stow"
brew "tmux"
brew "tokei"
brew "universal-ctags"
brew "uv"
brew "viddy"
brew "wakeonlan"
brew "watchexec"
brew "withgraphite/tap/graphite"
brew "xh"

# for localStack

brew "libvirt"
brew "snappy"

# Casks

cask "1password-cli"
cask "1password"
cask "betterdisplay"
cask "blender"
cask "brave-browser"
cask "claude-code"
cask "deskpad"
cask "docker-desktop"
cask "firefox@developer-edition"
cask "font-atkinson-hyperlegible-mono"
cask "font-commit-mono"
cask "font-lilex"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "iina"
cask "inkscape"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keymapp"
cask "mitmproxy"
cask "neovide"
cask "notion"
cask "obs"
cask "obsidian"
cask "pocket-casts"
cask "railwaycat/emacsmacport/emacs-mac"
cask "raycast"
cask "shotcut"
cask "slack"
cask "steam"
cask "tailscale-app"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet" if `hostname`.strip == "mm"
cask "wireshark-app"
cask "yaak"
cask "yubico-yubikey-manager" if `hostname`.strip == "mm"
cask "zed"
cask "zoom"

# for LocalStack

# Mac App Store apps
mas "1Password for Safari", id: 1569813296
mas "DaisyDisk", id: 411643860
