{
  "plugins": {
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "github-nvim-theme": [],
    "gitsigns.nvim": {
    },
    "mini.extra": {
    },
    "mini.pick": {
    },
    "mini.surround": {
    },
    "nvim": {
    },
    "nvim-lspconfig": {
    },
    "nvim-treesitter": {
      "version": "'master'"
    },
    "nvim-treesitter-context": [],
    "nvim-treesitter-textobjects": [],
    "oil.nvim": {
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "render-markdown.nvim": {
    },
    "telescope-fzf-native.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'0.1.x'"
    },
    "vim-conflicted": {
      "src": "https://github.com/christoomey/vim-conflicted"
    },
    "vim-fugitive": [],
    "vim-repeat": {
      "src": "https://github.com/tpope/vim-repeat"
    },
    "vim-rhubarb": [],
    "vim-surround": {
      "src": "https://github.com/tpope/vim-surround"
    },
    "vim-test": {
    },
    "zen-mode.nvim": {
    }
  }
}