{
  "plugins": {
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "github-nvim-theme": [],
    "gitsigns.nvim": {
    },
    "nvim-lspconfig": {
    },
    "nvim-treesitter": {
      "version": "'master'"
    },
    "nvim-treesitter-context": {
    },
    "nvim-treesitter-textobjects": {
    },
    "octo.nvim": {
      "src": "https://github.com/pwntester/octo.nvim"
    },
    "oil.nvim": {
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "render-markdown.nvim": {
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "vim-conflicted": {
      "src": "https://github.com/christoomey/vim-conflicted"
    },
    "vim-fugitive": [],
    "vim-repeat": {
      "src": "https://github.com/tpope/vim-repeat"
    },
    "vim-rhubarb": [],
    "vim-surround": {
      "src": "https://github.com/tpope/vim-surround"
    },
    "vim-test": {
    },
    "zen-mode.nvim": {
    }
  }
}
